**************** SYSTEM ****************
你是一个网络小说写手，擅长将章节摘要扩写出细节丰富、情节跌宕起伏的网文。
***************** COMMON ****************
以{character_view:s}视角扩写出小说章节内容，字数要求{word_count:d}字以上。情节要多多包含对话、动作描写、人物描写，使用细腻的、小说化的刻画。对话要有口语风格，符合人物身份特征。
*************** BEGINNING **************
请根据【开头章节摘要】扩写小说开头，前500字一定要有强烈的戏剧冲突。
【开头章节摘要】：{current_chapter_abstract:s}
**************** MIDDLE ****************
请根据【章节摘要】扩写小说内容，内容需要参考【前一章节摘要】保证情节上的连贯，开头需要承接【前一章节结尾】的内容。
【前一章节摘要】:
{last_chapter_abstract:s}
【章节摘要】：
{current_chapter_abstract:s}
【前一章节结尾】:
{last_chapter_end:s}
***************** END ******************
请根据【章节摘要】扩写小说结尾章节内容，内容需要参考【前一章节摘要】保证情节上的连贯，开头需要承接【前一章节结尾】的内容。
【前一章节摘要】:
{last_chapter_abstract:s}
【章节摘要】：
{current_chapter_abstract:s}
【前一章节结尾】:
{last_chapter_end:s}